dbetz/ch559usbhost/USBHost.c
unsigned char getDeviceDescriptor(PXUSBdevice pUSBdevice)
{
    unsigned char s;
    unsigned short len;
    endpoint0Size = DEFAULT_ENDP0_SIZE;		//TODO again?
	fillTxBuffer(GetDeviceDescriptorRequest, sizeof(GetDeviceDescriptorRequest));
    s = hostCtrlTransfer(receiveDataBuffer, &len, RECEIVE_BUFFER_LEN);          
    if (s != ERR_SUCCESS)
        return s;

	DEBUG_OUT("Device descriptor request sent successfully\n");
    endpoint0Size = ((PXUSB_DEV_DESCR)receiveDataBuffer)->bMaxPacketSize0;
    if (len < ((PUSB_SETUP_REQ)GetDeviceDescriptorRequest)->wLengthL)
    {
		DEBUG_OUT("Received packet is smaller than expected\n")
        return ERR_USB_BUF_OVER;                
    }
    
/*
	unsigned char   DeviceSpeed;
	Interface       interface[MAX_INTERFACE_COUNT];
*/

    PXUSB_DEV_DESCR pDeviceDesc = (PXUSB_DEV_DESCR)receiveDataBuffer;
    pUSBdevice->DeviceClass = pDeviceDesc->bDeviceClass;
    pUSBdevice->MaxPacketSize0 = pDeviceDesc->bMaxPacketSize0;
    pUSBdevice->VendorID = pDeviceDesc->idVendorL | (pDeviceDesc->idVendorH << 8);
    pUSBdevice->ProductID = pDeviceDesc->idProductL | (pDeviceDesc->idProductH << 8);
    pUSBdevice->bcdDevice = pDeviceDesc->bcdDeviceL | (pDeviceDesc->bcdDeviceH << 8);
    DEBUG_OUT( "DeviceClass:    0x%02x\n", pUSBdevice->DeviceClass);
    DEBUG_OUT( "MaxPacketSize0: 0x%02x\n", pUSBdevice->MaxPacketSize0);
    DEBUG_OUT( "VendorID:       0x%04x\n", pUSBdevice->VendorID);
    DEBUG_OUT( "ProductID:      0x%04x\n", pUSBdevice->ProductID);
    DEBUG_OUT( "bcdDevice:      0x%04x\n", pUSBdevice->bcdDevice);

    return ERR_SUCCESS;
}

unsigned char setUsbAddress(unsigned char addr)
{
    unsigned char s;
	PXUSB_SETUP_REQ pSetupReq = ((PXUSB_SETUP_REQ)TxBuffer);
    fillTxBuffer(SetUSBAddressRequest, sizeof(SetUSBAddressRequest));
    pSetupReq->wValueL = addr;          
    s = hostCtrlTransfer(0, 0, 0);   
    if (s != ERR_SUCCESS) return s;
    DEBUG_OUT( "SetAddress: %i\n" , addr);
    setHostUsbAddr(addr);
    delay(100);         
    return ERR_SUCCESS;
}

unsigned char setUsbConfig( unsigned char cfg )
{
    unsigned char s;
	PXUSB_SETUP_REQ pSetupReq = ((PXUSB_SETUP_REQ)TxBuffer);
    fillTxBuffer(SetupSetUsbConfig, sizeof(SetupSetUsbConfig));
    pSetupReq->wValueL = cfg;                          
    s = hostCtrlTransfer(0, 0, 0);
    return s;
}

unsigned char getDeviceString()
{
    fillTxBuffer(GetDeviceStringRequest, sizeof(GetDeviceStringRequest));                         
    return hostCtrlTransfer(receiveDataBuffer, 0, RECEIVE_BUFFER_LEN);
}

char convertStringDescriptor(unsigned char __xdata *usbBuffer, unsigned char __xdata *strBuffer, unsigned short bufferLength, unsigned char index)
{
	//supports using source as target buffer
	unsigned char i = 0, len = (usbBuffer[0] - 2) >> 1;
	if(usbBuffer[1] != 3) return 0;	//check if device string
	for(; (i < len) && (i < bufferLength - 1); i++)
		if(usbBuffer[2 + 1 + (i << 1)])
			strBuffer[i] = '?';
		else
			strBuffer[i] = usbBuffer[2 + (i << 1)];
	strBuffer[i] = 0;
	sendProtocolMSG(MSG_TYPE_DEVICE_STRING,(unsigned short)len, index+1, 0x34, 0x56, strBuffer);
	return 1;
}

void DEBUG_OUT_USB_BUFFER(unsigned char __xdata *usbBuffer)
{
	int i;
	for(i = 0; i < usbBuffer[0]; i++)
	{
		DEBUG_OUT("0x%02X ", (uint16_t)(usbBuffer[i]));
	}
	DEBUG_OUT("\n");
}

unsigned char getConfigurationDescriptor()
{
    unsigned char s;
    unsigned short len, total;
	fillTxBuffer(GetConfigurationDescriptorRequest, sizeof(GetConfigurationDescriptorRequest));

    s = hostCtrlTransfer(receiveDataBuffer, &len, RECEIVE_BUFFER_LEN);             
    if(s != ERR_SUCCESS)
        return s;
	//todo didnt send reqest completely
    if(len < ((PUSB_SETUP_REQ)GetConfigurationDescriptorRequest)->wLengthL)
        return ERR_USB_BUF_OVER;

	//todo fix 16bits
    total = ((PXUSB_CFG_DESCR)receiveDataBuffer)->wTotalLengthL + (((PXUSB_CFG_DESCR)receiveDataBuffer)->wTotalLengthH << 8);
	fillTxBuffer(GetConfigurationDescriptorRequest, sizeof(GetConfigurationDescriptorRequest));
    ((PUSB_SETUP_REQ)TxBuffer)->wLengthL = (unsigned char)(total & 255);
    ((PUSB_SETUP_REQ)TxBuffer)->wLengthH = (unsigned char)(total >> 8);
    s = hostCtrlTransfer(receiveDataBuffer, &len, RECEIVE_BUFFER_LEN);             
    if(s != ERR_SUCCESS)
        return s;
	//todo 16bit and fix received length check
	//if (len < total || len < ((PXUSB_CFG_DESCR)receiveDataBuffer)->wTotalLengthL)
    //    return( ERR_USB_BUF_OVER );                             
    return ERR_SUCCESS;
}

unsigned char getInterfaceDescriptor(unsigned char index)
{
	unsigned char temp = index;
	unsigned char s;
    unsigned short len;
	fillTxBuffer(GetInterfaceDescriptorRequest, sizeof(GetInterfaceDescriptorRequest));
    s = hostCtrlTransfer(receiveDataBuffer, &len, RECEIVE_BUFFER_LEN);             
	return s;                          
}

#define MAX_HID_DEVICES 8
HIDdevice __xdata hidDevices[MAX_HID_DEVICES];

void resetHubDevices(unsigned char hubindex)
{
    for (int i = 0; i < MAX_DEVICES; i++){
        usbDevices[i].VendorID = 0;
        usbDevices[i].ProductID = 0;
    }
	for (int i = 0; i < MAX_HID_DEVICES; i++)
	{
        if(hidDevices[i].usbDevice->RootHubIndex == hubindex){
            hidDevices[i].usbDevice  = NULL;
            hidDevices[i].interface  = 0;
            hidDevices[i].endPoint  = 0;
            hidDevices[i].type  = 0;
        }
	}
}

PXHIDdevice addHIDdevice(PXUSBdevice usbDevice, unsigned char interface, unsigned char endPoint)
{
    unsigned char i;
    for (i = 0; i < MAX_HID_DEVICES; i++)
    {
        if(hidDevices[i].usbDevice == NULL)break;
    }
    DEBUG_OUT("Connected device at position: %i\n", i);
    hidDevices[i].index = i;
    hidDevices[i].usbDevice = usbDevice;
    hidDevices[i].endPoint = endPoint;
    hidDevices[i].interface = interface;
    hidDevices[i].inHandler = NULL;
    DEBUG_OUT("Got endpoint for the device 0x%02x\n", hidDevices[i].endPoint);
    return &hidDevices[i];
}

